apache/nuttx/arch/arm/src/lpc17xx_40xx/hardware/lpc17_40_uart.h
/************************************************************************************
 * arch/arm/src/lpc17xx_40xx/hardware/lpc17_40_uart.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ************************************************************************************/

#ifndef __ARCH_ARM_SRC_LPC17XX_40XX_HARDWARE_LPC17_40_UART_H
#define __ARCH_ARM_SRC_LPC17XX_40XX_HARDWARE_LPC17_40_UART_H

/************************************************************************************
 * Included Files
 ************************************************************************************/

#include <nuttx/config.h>

#include "chip.h"
#include "hardware/lpc17_40_memorymap.h"

/************************************************************************************
 * Pre-processor Definitions
 ************************************************************************************/

/* Register offsets *****************************************************************/

#define LPC17_40_UART_RBR_OFFSET        0x0000 /* (DLAB =0) Receiver Buffer Register (all) */
#define LPC17_40_UART_THR_OFFSET        0x0000 /* (DLAB =0) Transmit Holding Register (all) */
#define LPC17_40_UART_DLL_OFFSET        0x0000 /* (DLAB =1) Divisor Latch LSB (all) */
#define LPC17_40_UART_DLM_OFFSET        0x0004 /* (DLAB =1) Divisor Latch MSB (all) */
#define LPC17_40_UART_IER_OFFSET        0x0004 /* (DLAB =0) Interrupt Enable Register (all) */
#define LPC17_40_UART_IIR_OFFSET        0x0008 /* Interrupt ID Register (all) */
#define LPC17_40_UART_FCR_OFFSET        0x0008 /* FIFO Control Register (all) */
#define LPC17_40_UART_LCR_OFFSET        0x000c /* Line Control Register (all) */
#define LPC17_40_UART_MCR_OFFSET        0x0010 /* Modem Control Register (UART1 only) */
#define LPC17_40_UART_LSR_OFFSET        0x0014 /* Line Status Register (all) */
#define LPC17_40_UART_MSR_OFFSET        0x0018 /* Modem Status Register (UART1 only) */
#define LPC17_40_UART_SCR_OFFSET        0x001c /* Scratch Pad Register (all) */
#define LPC17_40_UART_ACR_OFFSET        0x0020 /* Auto-baud Control Register (all) */
#define LPC17_40_UART_ICR_OFFSET        0x0024 /* IrDA Control Register (UART0,2,3 only) */
#define LPC17_40_UART_FDR_OFFSET        0x0028 /* Fractional Divider Register (all) */
#define LPC17_40_UART_TER_OFFSET        0x0030 /* Transmit Enable Register (all) */
#define LPC17_40_UART_RS485CTRL_OFFSET  0x004c /* RS-485/EIA-485 Control (UART1 only) */
#define LPC17_40_UART_ADRMATCH_OFFSET   0x0050 /* RS-485/EIA-485 address match (UART1 only) */
#define LPC17_40_UART_RS485DLY_OFFSET   0x0054 /* RS-485/EIA-485 direction control delay (UART1 only) */
#define LPC17_40_UART_FIFOLVL_OFFSET    0x0058 /* FIFO Level register (all) */

#ifdef LPC178x_40xx
#  define LPC17_40_UART_OSR_OFFSET      0x002c /* Oversampling Register (UART4 only) */
#  define LPC17_40_UART_SCICTRL_OFFSET  0x0048 /* Smart Card Interface Register (UART4 only) */
#  define LPC17_40_UART_SYNCCTRL_OFFSET 0x0058 /* Synchronous Mode  Register (UART4 only) */
#endif

/* Register addresses ***************************************************************/

#define LPC17_40_UART0_RBR              (LPC17_40_UART0_BASE+LPC17_40_UART_RBR_OFFSET)
#define LPC17_40_UART0_THR              (LPC17_40_UART0_BASE+LPC17_40_UART_THR_OFFSET)
#define LPC17_40_UART0_DLL              (LPC17_40_UART0_BASE+LPC17_40_UART_DLL_OFFSET)
#define LPC17_40_UART0_DLM              (LPC17_40_UART0_BASE+LPC17_40_UART_DLM_OFFSET)
#define LPC17_40_UART0_IER              (LPC17_40_UART0_BASE+LPC17_40_UART_IER_OFFSET)
#define LPC17_40_UART0_IIR              (LPC17_40_UART0_BASE+LPC17_40_UART_IIR_OFFSET)
#define LPC17_40_UART0_FCR              (LPC17_40_UART0_BASE+LPC17_40_UART_FCR_OFFSET)
#define LPC17_40_UART0_LCR              (LPC17_40_UART0_BASE+LPC17_40_UART_LCR_OFFSET)
#define LPC17_40_UART0_LSR              (LPC17_40_UART0_BASE+LPC17_40_UART_LSR_OFFSET)
#define LPC17_40_UART0_SCR              (LPC17_40_UART0_BASE+LPC17_40_UART_SCR_OFFSET)
#define LPC17_40_UART0_ACR              (LPC17_40_UART0_BASE+LPC17_40_UART_ACR_OFFSET)
#define LPC17_40_UART0_ICR              (LPC17_40_UART0_BASE+LPC17_40_UART_ICR_OFFSET)
#define LPC17_40_UART0_FDR              (LPC17_40_UART0_BASE+LPC17_40_UART_FDR_OFFSET)
#define LPC17_40_UART0_TER              (LPC17_40_UART0_BASE+LPC17_40_UART_TER_OFFSET)

#ifdef LPC178x_40xx
#  define LPC17_40_UART0_RS485CTRL      (LPC17_40_UART0_BASE+LPC17_40_UART_RS485CTRL_OFFSET)
#  define LPC17_40_UART0_ADRMATCH       (LPC17_40_UART0_BASE+LPC17_40_UART_ADRMATCH_OFFSET)
#  define LPC17_40_UART0_RS485DLY       (LPC17_40_UART0_BASE+LPC17_40_UART_RS485DLY_OFFSET)
#endif

#define LPC17_40_UART0_FIFOLVL          (LPC17_40_UART0_BASE+LPC17_40_UART_FIFOLVL_OFFSET)

#define LPC17_40_UART1_RBR              (LPC17_40_UART1_BASE+LPC17_40_UART_RBR_OFFSET)
#define LPC17_40_UART1_THR              (LPC17_40_UART1_BASE+LPC17_40_UART_THR_OFFSET)
#define LPC17_40_UART1_DLL              (LPC17_40_UART1_BASE+LPC17_40_UART_DLL_OFFSET)
#define LPC17_40_UART1_DLM              (LPC17_40_UART1_BASE+LPC17_40_UART_DLM_OFFSET)
#define LPC17_40_UART1_IER              (LPC17_40_UART1_BASE+LPC17_40_UART_IER_OFFSET)
#define LPC17_40_UART1_IIR              (LPC17_40_UART1_BASE+LPC17_40_UART_IIR_OFFSET)
#define LPC17_40_UART1_FCR              (LPC17_40_UART1_BASE+LPC17_40_UART_FCR_OFFSET)
#define LPC17_40_UART1_LCR              (LPC17_40_UART1_BASE+LPC17_40_UART_LCR_OFFSET)
#define LPC17_40_UART1_MCR              (LPC17_40_UART1_BASE+LPC17_40_UART_MCR_OFFSET)
#define LPC17_40_UART1_LSR              (LPC17_40_UART1_BASE+LPC17_40_UART_LSR_OFFSET)
#define LPC17_40_UART1_MSR              (LPC17_40_UART1_BASE+LPC17_40_UART_MSR_OFFSET)
#define LPC17_40_UART1_SCR              (LPC17_40_UART1_BASE+LPC17_40_UART_SCR_OFFSET)
#define LPC17_40_UART1_ACR              (LPC17_40_UART1_BASE+LPC17_40_UART_ACR_OFFSET)
#define LPC17_40_UART1_FDR              (LPC17_40_UART1_BASE+LPC17_40_UART_FDR_OFFSET)
#define LPC17_40_UART1_TER              (LPC17_40_UART1_BASE+LPC17_40_UART_TER_OFFSET)
#define LPC17_40_UART1_RS485CTRL        (LPC17_40_UART1_BASE+LPC17_40_UART_RS485CTRL_OFFSET)
#define LPC17_40_UART1_ADRMATCH         (LPC17_40_UART1_BASE+LPC17_40_UART_ADRMATCH_OFFSET)
#define LPC17_40_UART1_RS485DLY         (LPC17_40_UART1_BASE+LPC17_40_UART_RS485DLY_OFFSET)
#define LPC17_40_UART1_FIFOLVL          (LPC17_40_UART1_BASE+LPC17_40_UART_FIFOLVL_OFFSET)

#define LPC17_40_UART2_RBR              (LPC17_40_UART2_BASE+LPC17_40_UART_RBR_OFFSET)
#define LPC17_40_UART2_THR              (LPC17_40_UART2_BASE+LPC17_40_UART_THR_OFFSET)
#define LPC17_40_UART2_DLL              (LPC17_40_UART2_BASE+LPC17_40_UART_DLL_OFFSET)
#define LPC17_40_UART2_DLM              (LPC17_40_UART2_BASE+LPC17_40_UART_DLM_OFFSET)
#define LPC17_40_UART2_IER              (LPC17_40_UART2_BASE+LPC17_40_UART_IER_OFFSET)
#define LPC17_40_UART2_IIR              (LPC17_40_UART2_BASE+LPC17_40_UART_IIR_OFFSET)
#define LPC17_40_UART2_FCR              (LPC17_40_UART2_BASE+LPC17_40_UART_FCR_OFFSET)
#define LPC17_40_UART2_LCR              (LPC17_40_UART2_BASE+LPC17_40_UART_LCR_OFFSET)
#define LPC17_40_UART2_LSR              (LPC17_40_UART2_BASE+LPC17_40_UART_LSR_OFFSET)
#define LPC17_40_UART2_SCR              (LPC17_40_UART2_BASE+LPC17_40_UART_SCR_OFFSET)
#define LPC17_40_UART2_ACR              (LPC17_40_UART2_BASE+LPC17_40_UART_ACR_OFFSET)
#define LPC17_40_UART2_ICR              (LPC17_40_UART2_BASE+LPC17_40_UART_ICR_OFFSET)
#define LPC17_40_UART2_FDR              (LPC17_40_UART2_BASE+LPC17_40_UART_FDR_OFFSET)
#define LPC17_40_UART2_TER              (LPC17_40_UART2_BASE+LPC17_40_UART_TER_OFFSET)

#ifdef LPC178x_40xx
#  define LPC17_40_UART2_RS485CTRL      (LPC17_40_UART2_BASE+LPC17_40_UART_RS485CTRL_OFFSET)
#  define LPC17_40_UART2_ADRMATCH       (LPC17_40_UART2_BASE+LPC17_40_UART_ADRMATCH_OFFSET)
#  define LPC17_40_UART2_RS485DLY       (LPC17_40_UART2_BASE+LPC17_40_UART_RS485DLY_OFFSET)
#endif

#define LPC17_40_UART2_FIFOLVL          (LPC17_40_UART2_BASE+LPC17_40_UART_FIFOLVL_OFFSET)

#define LPC17_40_UART3_RBR              (LPC17_40_UART3_BASE+LPC17_40_UART_RBR_OFFSET)
#define LPC17_40_UART3_THR              (LPC17_40_UART3_BASE+LPC17_40_UART_THR_OFFSET)
#define LPC17_40_UART3_DLL              (LPC17_40_UART3_BASE+LPC17_40_UART_DLL_OFFSET)
#define LPC17_40_UART3_DLM              (LPC17_40_UART3_BASE+LPC17_40_UART_DLM_OFFSET)
#define LPC17_40_UART3_IER              (LPC17_40_UART3_BASE+LPC17_40_UART_IER_OFFSET)
#define LPC17_40_UART3_IIR              (LPC17_40_UART3_BASE+LPC17_40_UART_IIR_OFFSET)
#define LPC17_40_UART3_FCR              (LPC17_40_UART3_BASE+LPC17_40_UART_FCR_OFFSET)
#define LPC17_40_UART3_LCR              (LPC17_40_UART3_BASE+LPC17_40_UART_LCR_OFFSET)
#define LPC17_40_UART3_LSR              (LPC17_40_UART3_BASE+LPC17_40_UART_LSR_OFFSET)
#define LPC17_40_UART3_SCR              (LPC17_40_UART3_BASE+LPC17_40_UART_SCR_OFFSET)
#define LPC17_40_UART3_ACR              (LPC17_40_UART3_BASE+LPC17_40_UART_ACR_OFFSET)
#define LPC17_40_UART3_ICR              (LPC17_40_UART3_BASE+LPC17_40_UART_ICR_OFFSET)
#define LPC17_40_UART3_FDR              (LPC17_40_UART3_BASE+LPC17_40_UART_FDR_OFFSET)
#define LPC17_40_UART3_TER              (LPC17_40_UART3_BASE+LPC17_40_UART_TER_OFFSET)

#ifdef LPC178x_40xx
#  define LPC17_40_UART3_RS485CTRL      (LPC17_40_UART3_BASE+LPC17_40_UART_RS485CTRL_OFFSET)
#  define LPC17_40_UART3_ADRMATCH       (LPC17_40_UART3_BASE+LPC17_40_UART_ADRMATCH_OFFSET)
#  define LPC17_40_UART3_RS485DLY       (LPC17_40_UART3_BASE+LPC17_40_UART_RS485DLY_OFFSET)
#endif

