apache/nuttx/arch/arm/src/lpc17xx_40xx/hardware/lpc17_40_uart.h
#define LPC17_40_UART3_FIFOLVL          (LPC17_40_UART3_BASE+LPC17_40_UART_FIFOLVL_OFFSET)

#ifdef LPC178x_40xx
#  define LPC17_40_UART4_RBR            (LPC17_40_UART4_BASE+LPC17_40_UART_RBR_OFFSET)
#  define LPC17_40_UART4_THR            (LPC17_40_UART4_BASE+LPC17_40_UART_THR_OFFSET)
#  define LPC17_40_UART4_DLL            (LPC17_40_UART4_BASE+LPC17_40_UART_DLL_OFFSET)
#  define LPC17_40_UART4_DLM            (LPC17_40_UART4_BASE+LPC17_40_UART_DLM_OFFSET)
#  define LPC17_40_UART4_IER            (LPC17_40_UART4_BASE+LPC17_40_UART_IER_OFFSET)
#  define LPC17_40_UART4_IIR            (LPC17_40_UART4_BASE+LPC17_40_UART_IIR_OFFSET)
#  define LPC17_40_UART4_FCR            (LPC17_40_UART4_BASE+LPC17_40_UART_FCR_OFFSET)
#  define LPC17_40_UART4_LCR            (LPC17_40_UART4_BASE+LPC17_40_UART_LCR_OFFSET)
#  define LPC17_40_UART4_LSR            (LPC17_40_UART4_BASE+LPC17_40_UART_LSR_OFFSET)
#  define LPC17_40_UART4_SCR            (LPC17_40_UART4_BASE+LPC17_40_UART_SCR_OFFSET)
#  define LPC17_40_UART4_ACR            (LPC17_40_UART4_BASE+LPC17_40_UART_ACR_OFFSET)
#  define LPC17_40_UART4_ICR            (LPC17_40_UART4_BASE+LPC17_40_UART_ICR_OFFSET)
#  define LPC17_40_UART4_FDR            (LPC17_40_UART4_BASE+LPC17_40_UART_FDR_OFFSET)
#  define LPC17_40_UART4_TER            (LPC17_40_UART4_BASE+LPC17_40_UART_TER_OFFSET)
#  define LPC17_40_UART4_RS485CTRL      (LPC17_40_UART4_BASE+LPC17_40_UART_RS485CTRL_OFFSET)
#  define LPC17_40_UART4_ADRMATCH       (LPC17_40_UART4_BASE+LPC17_40_UART_ADRMATCH_OFFSET)
#  define LPC17_40_UART4_RS485DLY       (LPC17_40_UART4_BASE+LPC17_40_UART_RS485DLY_OFFSET)
#  define LPC17_40_UART4_FIFOLVL        (LPC17_40_UART4_BASE+LPC17_40_UART_FIFOLVL_OFFSET)
#  define LPC17_40_UART4_OSR            (LPC17_40_UART4_BASE+LPC17_40_UART4_OSR_OFFSET)
#  define LPC17_40_UART4_SCICTRL        (LPC17_40_UART4_BASE+LPC17_40_UART4_SCICTRL_OFFSET)
#  define LPC17_40_UART4_SYNCCTRL       (LPC17_40_UART4_BASE+LPC17_40_UART4_SYNCCTRL_OFFSET)
#endif

/* Register bit definitions *********************************************************/

/* RBR (DLAB =0) Receiver Buffer Register (all) */

#define UART_RBR_MASK                   (0xff)    /* Bits 0-7: Oldest received byte in RX FIFO */
                                                  /* Bits 8-31: Reserved */

/* THR (DLAB =0) Transmit Holding Register (all) */

#define UART_THR_MASK                   (0xff)    /* Bits 0-7: Adds byte to TX FIFO */
                                                  /* Bits 8-31: Reserved */

/* DLL (DLAB =1) Divisor Latch LSB (all) */

#define UART_DLL_MASK                   (0xff)    /* Bits 0-7: DLL */
                                                  /* Bits 8-31: Reserved */

/* DLM (DLAB =1) Divisor Latch MSB (all) */

#define UART_DLM_MASK                   (0xff)    /* Bits 0-7: DLM */
                                                  /* Bits 8-31: Reserved */

/* IER (DLAB =0) Interrupt Enable Register (all) */

#define UART_IER_RBRIE                  (1 << 0)  /* Bit 0: RBR Interrupt Enable */
#define UART_IER_THREIE                 (1 << 1)  /* Bit 1: THRE Interrupt Enable */
#define UART_IER_RLSIE                  (1 << 2)  /* Bit 2: RX Line Status Interrupt Enable */
#define UART_IER_MSIE                   (1 << 3)  /* Bit 3: Modem Status Interrupt Enable (UART1 only) */
                                                  /* Bits 4-6: Reserved */
#define UART_IER_CTSIE                  (1 << 7)  /* Bit 7: CTS transition interrupt (UART1 only) */
#define UART_IER_ABEOIE                 (1 << 8)  /* Bit 8: Enables the end of auto-baud interrupt */
#define UART_IER_ABTOIE                 (1 << 9)  /* Bit 9: Enables the auto-baud time-out interrupt */
                                                  /* Bits 10-31: Reserved */
#define UART_IER_ALLIE                  (0x038f)

/* IIR Interrupt ID Register (all) */

#define UART_IIR_INTSTATUS              (1 << 0)  /* Bit 0:  Interrupt status (active low) */
#define UART_IIR_INTID_SHIFT            (1)       /* Bits 1-3: Interrupt identification */
#define UART_IIR_INTID_MASK             (7 << UART_IIR_INTID_SHIFT)
#  define UART_IIR_INTID_MSI            (0 << UART_IIR_INTID_SHIFT) /* Modem Status (UART1 only) */
#  define UART_IIR_INTID_THRE           (1 << UART_IIR_INTID_SHIFT) /* THRE Interrupt */
#  define UART_IIR_INTID_RDA            (2 << UART_IIR_INTID_SHIFT) /* 2a - Receive Data Available (RDA) */
#  define UART_IIR_INTID_RLS            (3 << UART_IIR_INTID_SHIFT) /* 1 - Receive Line Status (RLS) */
#  define UART_IIR_INTID_CTI            (6 << UART_IIR_INTID_SHIFT) /* 2b - Character Time-out Indicator (CTI) */
                                                  /* Bits 4-5: Reserved */
#define UART_IIR_FIFOEN_SHIFT           (6)       /* Bits 6-7: Copies of FCR bit 0 */
#define UART_IIR_FIFOEN_MASK            (3 << UART_IIR_FIFOEN_SHIFT)
#define UART_IIR_ABEOINT                (1 << 8)  /* Bit 8:  End of auto-baud interrupt */
#define UART_IIR_ABTOINT                (1 << 9)  /* Bit 9:  Auto-baud time-out interrupt */
                                                  /* Bits 10-31: Reserved */
/* FCR FIFO Control Register (all) */

#define UART_FCR_FIFOEN                 (1 << 0)  /* Bit 0:  Enable FIFOs */
#define UART_FCR_RXRST                  (1 << 1)  /* Bit 1:  RX FIFO Reset */
#define UART_FCR_TXRST                  (1 << 2)  /* Bit 2:  TX FIFO Reset */
#define UART_FCR_DMAMODE                (1 << 3)  /* Bit 3:  DMA Mode Select */
                                                  /* Bits 4-5: Reserved */
#define UART_FCR_RXTRIGGER_SHIFT        (6)       /* Bits 6-7: RX Trigger Level */
#define UART_FCR_RXTRIGGER_MASK         (3 << UART_FCR_RXTRIGGER_SHIFT)
#  define UART_FCR_RXTRIGGER_0          (0 << UART_FCR_RXTRIGGER_SHIFT) /* Trigger level 0 (1 character) */
#  define UART_FCR_RXTRIGGER_4          (1 << UART_FCR_RXTRIGGER_SHIFT) /* Trigger level 1 (4 characters) */
#  define UART_FCR_RXTRIGGER_8          (2 << UART_FCR_RXTRIGGER_SHIFT) /* Trigger level 2 (8 characters) */
#  define UART_FCR_RXTRIGGER_14         (3 << UART_FCR_RXTRIGGER_SHIFT) /* Trigger level 3 (14 characters) */
                                                  /* Bits 8-31: Reserved */
/* LCR Line Control Register (all) */

#define UART_LCR_WLS_SHIFT              (0)       /* Bit 0-1: Word Length Select */
#define UART_LCR_WLS_MASK               (3 << UART_LCR_WLS_SHIFT)
#  define UART_LCR_WLS_5BIT             (0 << UART_LCR_WLS_SHIFT)
#  define UART_LCR_WLS_6BIT             (1 << UART_LCR_WLS_SHIFT)
#  define UART_LCR_WLS_7BIT             (2 << UART_LCR_WLS_SHIFT)
#  define UART_LCR_WLS_8BIT             (3 << UART_LCR_WLS_SHIFT)
#define UART_LCR_STOP                   (1 << 2)  /* Bit 2:  Stop Bit Select */
#define UART_LCR_PE                     (1 << 3)  /* Bit 3:  Parity Enable */
#define UART_LCR_PS_SHIFT               (4)       /* Bits 4-5: Parity Select */
#define UART_LCR_PS_MASK                (3 << UART_LCR_PS_SHIFT)
#  define UART_LCR_PS_ODD               (0 << UART_LCR_PS_SHIFT) /* Odd parity */
#  define UART_LCR_PS_EVEN              (1 << UART_LCR_PS_SHIFT) /* Even Parity */
#  define UART_LCR_PS_STICK1            (2 << UART_LCR_PS_SHIFT) /* Forced "1" stick parity */
#  define UART_LCR_PS_STICK0            (3 << UART_LCR_PS_SHIFT) /* Forced "0" stick parity */
#define UART_LCR_BRK                    (1 << 6)  /* Bit 6: Break Control */
#define UART_LCR_DLAB                   (1 << 7)  /* Bit 7: Divisor Latch Access Bit (DLAB) */
                                                  /* Bits 8-31: Reserved */
/* MCR Modem Control Register (UART1 only) */

