apache/nuttx/arch/arm/src/lpc17xx_40xx/hardware/lpc17_40_uart.h
#define UART_MCR_DTR                    (1 << 0)  /* Bit 0:  DTR Control Source for DTR output */
#define UART_MCR_RTS                    (1 << 1)  /* Bit 1:  Control Source for  RTS output */
                                                  /* Bits 2-3: Reserved */
#define UART_MCR_LPBK                   (1 << 4)  /* Bit 4:  Loopback Mode Select */
                                                  /* Bit 5:  Reserved */
#define UART_MCR_RTSEN                  (1 << 6)  /* Bit 6:  Enable auto-rts flow control */
#define UART_MCR_CTSEN                  (1 << 7)  /* Bit 7:  Enable auto-cts flow control */
                                                  /* Bits 8-31: Reserved */
/* LSR Line Status Register (all) */

#define UART_LSR_RDR                    (1 << 0)  /* Bit 0:  Receiver Data Ready */
#define UART_LSR_OE                     (1 << 1)  /* Bit 1:  Overrun Error */
#define UART_LSR_PE                     (1 << 2)  /* Bit 2:  Parity Error */
#define UART_LSR_FE                     (1 << 3)  /* Bit 3:  Framing Error */
#define UART_LSR_BI                     (1 << 4)  /* Bit 4:  Break Interrupt */
#define UART_LSR_THRE                   (1 << 5)  /* Bit 5:  Transmitter Holding Register Empty */
#define UART_LSR_TEMT                   (1 << 6)  /* Bit 6:  Transmitter Empty */
#define UART_LSR_RXFE                   (1 << 7)  /* Bit 7:  Error in RX FIFO (RXFE) */
                                                  /* Bits 8-31: Reserved */
/* MSR Modem Status Register (UART1 only) */

#define UART_MSR_DELTACTS               (1 << 0)  /* Bit 0:  CTS state change */
#define UART_MSR_DELTADSR               (1 << 1)  /* Bit 1:  DSR state change */
#define UART_MSR_RIEDGE                 (1 << 2)  /* Bit 2:  RI ow to high transition */
#define UART_MSR_DELTADCD               (1 << 3)  /* Bit 3:  DCD state change */
#define UART_MSR_CTS                    (1 << 4)  /* Bit 4:  CTS State */
#define UART_MSR_DSR                    (1 << 5)  /* Bit 5:  DSR State */
#define UART_MSR_RI                     (1 << 6)  /* Bit 6:  Ring Indicator State */
#define UART_MSR_DCD                    (1 << 7)  /* Bit 7:  Data Carrier Detect State */
                                                  /* Bits 8-31: Reserved */
/* SCR Scratch Pad Register (all) */

#define UART_SCR_MASK                   (0xff)    /* Bits 0-7: SCR data */
                                                  /* Bits 8-31: Reserved */
/* ACR Auto-baud Control Register (all) */

#define UART_ACR_START                  (1 << 0)  /* Bit 0:  Auto-baud start/running*/
#define UART_ACR_MODE                   (1 << 1)  /* Bit 1:  Auto-baud mode select*/
#define UART_ACR_AUTORESTART            (1 << 2)  /* Bit 2:  Restart in case of time-out*/
                                                  /* Bits 3-7: Reserved */
#define UART_ACR_ABEOINTCLR             (1 << 8)  /* Bit 8:  End of auto-baud interrupt clear */
#define UART_ACR_ABTOINTCLRT            (1 << 9)  /* Bit 9:  Auto-baud time-out interrupt clear */
                                                  /* Bits 10-31: Reserved */
/* ICA IrDA Control Register (UART0,2,3 only) */

#define UART_ICR_IRDAEN                 (1 << 0)  /* Bit 0:  Enable IrDA mode */
#define UART_ICR_IRDAINV                (1 << 1)  /* Bit 1:  Invert serial input */
#define UART_ICR_FIXPULSEEN             (1 << 2)  /* Bit 2:  Enable IrDA fixed pulse width mode */
#define UART_ICR_PULSEDIV_SHIFT         (3)       /* Bits 3-5: Configures the pulse when FixPulseEn = 1 */
#define UART_ICR_PULSEDIV_MASK          (7 << UART_ICR_PULSEDIV_SHIFT)
#  define UART_ICR_PULSEDIV_2TPCLK      (0 << UART_ICR_PULSEDIV_SHIFT) /* 2 x TPCLK */
#  define UART_ICR_PULSEDIV_4TPCLK      (1 << UART_ICR_PULSEDIV_SHIFT) /* 4 x TPCLK */
#  define UART_ICR_PULSEDIV_8TPCLK      (2 << UART_ICR_PULSEDIV_SHIFT) /* 8 x TPCLK */
#  define UART_ICR_PULSEDIV_16TPCLK     (3 << UART_ICR_PULSEDIV_SHIFT) /* 16 x TPCLK */
#  define UART_ICR_PULSEDIV_32TPCLK     (4 << UART_ICR_PULSEDIV_SHIFT) /* 32 x TPCLK */
#  define UART_ICR_PULSEDIV_64TPCLK     (5 << UART_ICR_PULSEDIV_SHIFT) /* 64 x TPCLK */
#  define UART_ICR_PULSEDIV_128TPCLK    (6 << UART_ICR_PULSEDIV_SHIFT) /* 128 x TPCLK */
#  define UART_ICR_PULSEDIV_256TPCLK    (7 << UART_ICR_PULSEDIV_SHIFT) /* 246 x TPCLK */
                                                  /* Bits 6-31: Reserved */
/* FDR Fractional Divider Register (all) */

#define UART_FDR_DIVADDVAL_SHIFT        (0)       /* Bits 0-3: Baud-rate generation pre-scaler divisor value */
#define UART_FDR_DIVADDVAL_MASK         (15 << UART_FDR_DIVADDVAL_SHIFT)
#define UART_FDR_MULVAL_SHIFT           (4)       /* Bits 4-7 Baud-rate pre-scaler multiplier value */
#define UART_FDR_MULVAL_MASK            (15 << UART_FDR_MULVAL_SHIFT)
                                                  /* Bits 8-31: Reserved */
/* TER Transmit Enable Register (all) */
                                                  /* Bits 0-6: Reserved */
#define UART_TER_TXEN                   (1 << 7)  /* Bit 7:  TX Enable */
                                                  /* Bits 8-31: Reserved */
/* RS-485/EIA-485 Control (UART1 only) */

#define UART_RS485CTRL_NMMEN            (1 << 0)  /* Bit 0: RS-485/EIA-485 Normal Multidrop Mode (NMM) enabled */
#define UART_RS485CTRL_RXDIS            (1 << 1)  /* Bit 1: Receiver is disabled */
#define UART_RS485CTRL_AADEN            (1 << 2)  /* Bit 2: Auto Address Detect (AAD) is enabled */
#define UART_RS485CTRL_SEL              (1 << 3)  /* Bit 3: RTS/DTR used for direction control (DCTRL=1) */
#define UART_RS485CTRL_DCTRL            (1 << 4)  /* Bit 4: Enable Auto Direction Control */
#define UART_RS485CTRL_OINV             (1 << 5)  /* Bit 5: Polarity of the direction control signal on RTS/DTR */
                                                  /* Bits 6-31: Reserved */
/* RS-485/EIA-485 address match (UART1 only) */

#define UART_ADRMATCH_MASK              (0xff)    /* Bits 0-7: Address match value */
                                                  /* Bits 8-31: Reserved */
/* RS-485/EIA-485 direction control delay (UART1 only) */

#define UART_RS485DLY_MASK              (0xff)    /* Bits 0-7: Direction control (RTS/DTR) delay */
                                                  /* Bits 8-31: Reserved */
/* FIFOLVL FIFO Level register (all) */

#define UART_FIFOLVL_RX_SHIFT           (0)       /* Bits 0-3: Current level of the UART RX FIFO */
#define UART_FIFOLVL_RX_MASK            (15 << UART_FIFOLVL_RX_SHIFT)
                                                  /* Bits 4-7: Reserved */
#define UART_FIFOLVL_TX_SHIFT           (8)       /* Bits 8-11: Current level of the UART TX FIFO */
#define UART_FIFOLVL_TX_MASK            (15 << UART_FIFOLVL_TX_SHIFT)
                                                  /* Bits 12-31: Reserved */

/* SCICTL Smart Card Interface (UART4 only) */

#ifdef LPC178x_40xx
#  define UART_SCIEN                    (1 << 0)  /* Bit 0: Smart Card Interface enable */
#  define UART_NACKDIS                  (1 << 1)  /* Bit 1: NACK response disable.Applicable if PROTSEL=0 */
#  define UART_PROTSEL                  (1 << 2)  /* Bit 2: Protocol Selection ISO7816-3 */
#  define UART_TXRETRY                  (7 << 5)  /* Bits 5-7: Maximum number of Re-Transmission */
#  define UART_GUARDTIME_SHIFT          (8)       /* Bits 8-15: Extra guard time */
#  define UART_GUARDTIME_MASK           (0xff << UART_GUARDTIME_SHIFT)
                                                  /* Bits 16-31: Reserved */
#endif

/* OSR Oversampling Register (UART4 only) */

#ifdef LPC178x_40xx
                                                  /* Bit 0: Reserved */
#  define UART_OSFRAC                   (7 << 1)  /* Bits 1-3: Fractional part of Oversampling Ratio */
#  define UART_OSINT_SHIFT              (4)       /* Bits 4-7:  Integer part of (Oversampling Ratio -1) */
#  define UART_OSINT_MASK               (0x0f << UART_OSINT_SHIFT)
#  define UART_FDINT_SHIFT              (8)       /* Bits 8-14: OSINT extension in Smart Card mode */
#  define UART_FDINT_MASK               (0x7f << UART_FDINT_SHIFT)
                                                  /* Bits 15-31: Reserved */
#endif

/************************************************************************************
 * Public Types
 ************************************************************************************/

/************************************************************************************
 * Public Data
 ************************************************************************************/

/************************************************************************************
 * Public Functions
 ************************************************************************************/

#endif /* __ARCH_ARM_SRC_LPC17XX_40XX_HARDWARE_LPC17_40_UART_H */
